RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_dma.h
#define DMA_REQUEST_ADC2_ROUTINE          RM_CHXCFG_MUXID(123U)                                                        /*!< DMAMUX ADC2 routine request */
#define DMA_REQUEST_FAC_READ              RM_CHXCFG_MUXID(124U)                                                        /*!< DMAMUX FAC READ request */
#define DMA_REQUEST_FAC_WRITE             RM_CHXCFG_MUXID(125U)                                                        /*!< DMAMUX FAC WRITE request */
#define DMA_REQUEST_TMU_WRITE             RM_CHXCFG_MUXID(126U)                                                        /*!< DMAMUX TMU WRITE request */
#define DMA_REQUEST_TMU_READ              RM_CHXCFG_MUXID(127U)                                                        /*!< DMAMUX TMU READ request */
#define DMA_REQUEST_TIMER22_CH0           RM_CHXCFG_MUXID(128U)                                                        /*!< DMAMUX TIMER22 CH0 request */
#define DMA_REQUEST_TIMER22_CH1           RM_CHXCFG_MUXID(129U)                                                        /*!< DMAMUX TIMER22 CH1 request */
#define DMA_REQUEST_TIMER22_CH2           RM_CHXCFG_MUXID(130U)                                                        /*!< DMAMUX TIMER22 CH2 request */
#define DMA_REQUEST_TIMER22_CH3           RM_CHXCFG_MUXID(131U)                                                        /*!< DMAMUX TIMER22 CH3 request */
#define DMA_REQUEST_TIMER22_UP            RM_CHXCFG_MUXID(132U)                                                        /*!< DMAMUX TIMER22 UP request */
#define DMA_REQUEST_TIMER22_TRG           RM_CHXCFG_MUXID(134U)                                                        /*!< DMAMUX TIMER22 TRG request */
#define DMA_REQUEST_TIMER23_CH0           RM_CHXCFG_MUXID(135U)                                                        /*!< DMAMUX TIMER23 CH0 request */
#define DMA_REQUEST_TIMER23_CH1           RM_CHXCFG_MUXID(136U)                                                        /*!< DMAMUX TIMER23 CH1 request */
#define DMA_REQUEST_TIMER23_CH2           RM_CHXCFG_MUXID(137U)                                                        /*!< DMAMUX TIMER23 CH2 request */
#define DMA_REQUEST_TIMER23_CH3           RM_CHXCFG_MUXID(138U)                                                        /*!< DMAMUX TIMER23 CH3 request */
#define DMA_REQUEST_TIMER23_UP            RM_CHXCFG_MUXID(139U)                                                        /*!< DMAMUX TIMER23 UP request */
#define DMA_REQUEST_TIMER23_TRG           RM_CHXCFG_MUXID(141U)                                                        /*!< DMAMUX TIMER23 TRG request */
#define DMA_REQUEST_TIMER30_CH0           RM_CHXCFG_MUXID(142U)                                                        /*!< DMAMUX TIMER30 CH0 request */
#define DMA_REQUEST_TIMER30_CH1           RM_CHXCFG_MUXID(143U)                                                        /*!< DMAMUX TIMER30 CH1 request */
#define DMA_REQUEST_TIMER30_CH2           RM_CHXCFG_MUXID(144U)                                                        /*!< DMAMUX TIMER30 CH2 request */
#define DMA_REQUEST_TIMER30_CH3           RM_CHXCFG_MUXID(145U)                                                        /*!< DMAMUX TIMER30 CH3 request */
#define DMA_REQUEST_TIMER30_UP            RM_CHXCFG_MUXID(146U)                                                        /*!< DMAMUX TIMER30 UP request */
#define DMA_REQUEST_TIMER30_TRG           RM_CHXCFG_MUXID(148U)                                                        /*!< DMAMUX TIMER30 TRG request */
#define DMA_REQUEST_TIMER31_CH0           RM_CHXCFG_MUXID(149U)                                                        /*!< DMAMUX TIMER31 CH0 request */
#define DMA_REQUEST_TIMER31_CH1           RM_CHXCFG_MUXID(150U)                                                        /*!< DMAMUX TIMER31 CH1 request */
#define DMA_REQUEST_TIMER31_CH2           RM_CHXCFG_MUXID(151U)                                                        /*!< DMAMUX TIMER31 CH2 request */
#define DMA_REQUEST_TIMER31_CH3           RM_CHXCFG_MUXID(152U)                                                        /*!< DMAMUX TIMER31 CH3 request */
#define DMA_REQUEST_TIMER31_UP            RM_CHXCFG_MUXID(154U)                                                        /*!< DMAMUX TIMER31 UP request */
#define DMA_REQUEST_TIMER31_TRG           RM_CHXCFG_MUXID(155U)                                                        /*!< DMAMUX TIMER31 TRG request */
#define DMA_REQUEST_TIMER40_CH0           RM_CHXCFG_MUXID(156U)                                                        /*!< DMAMUX TIMER40 CH0 request */
#define DMA_REQUEST_TIMER40_MCH0          RM_CHXCFG_MUXID(157U)                                                        /*!< DMAMUX TIMER40 MCH0 request */
#define DMA_REQUEST_TIMER40_CMT           RM_CHXCFG_MUXID(158U)                                                        /*!< DMAMUX TIMER40 CMT request */
#define DMA_REQUEST_TIMER40_UP            RM_CHXCFG_MUXID(159U)                                                        /*!< DMAMUX TIMER40 UP request */
#define DMA_REQUEST_TIMER41_CH0           RM_CHXCFG_MUXID(160U)                                                        /*!< DMAMUX TIMER41 CH0 request */
#define DMA_REQUEST_TIMER41_MCH0          RM_CHXCFG_MUXID(161U)                                                        /*!< DMAMUX TIMER41 MCH0 request */
#define DMA_REQUEST_TIMER41_CMT           RM_CHXCFG_MUXID(162U)                                                        /*!< DMAMUX TIMER41 CMT request */
#define DMA_REQUEST_TIMER41_UP            RM_CHXCFG_MUXID(163U)                                                        /*!< DMAMUX TIMER41 UP request */
#define DMA_REQUEST_TIMER42_CH0           RM_CHXCFG_MUXID(164U)                                                        /*!< DMAMUX TIMER42 CH0 request */
#define DMA_REQUEST_TIMER42_MCH0          RM_CHXCFG_MUXID(165U)                                                        /*!< DMAMUX TIMER42 MCH0 request */
#define DMA_REQUEST_TIMER42_CMT           RM_CHXCFG_MUXID(166U)                                                        /*!< DMAMUX TIMER42 CMT request */
#define DMA_REQUEST_TIMER42_UP            RM_CHXCFG_MUXID(167U)                                                        /*!< DMAMUX TIMER42 UP request */
#define DMA_REQUEST_TIMER43_CH0           RM_CHXCFG_MUXID(168U)                                                        /*!< DMAMUX TIMER43 CH0 request */
#define DMA_REQUEST_TIMER43_MCH0          RM_CHXCFG_MUXID(169U)                                                        /*!< DMAMUX TIMER43 MCH0 request */
#define DMA_REQUEST_TIMER43_CMT           RM_CHXCFG_MUXID(170U)                                                        /*!< DMAMUX TIMER43 CMT request */
#define DMA_REQUEST_TIMER43_UP            RM_CHXCFG_MUXID(171U)                                                        /*!< DMAMUX TIMER43 UP request */
#define DMA_REQUEST_TIMER44_CH0           RM_CHXCFG_MUXID(172U)                                                        /*!< DMAMUX TIMER44 CH0 request */
#define DMA_REQUEST_TIMER44_MCH0          RM_CHXCFG_MUXID(173U)                                                        /*!< DMAMUX TIMER44 MCH0 request */
#define DMA_REQUEST_TIMER44_CMT           RM_CHXCFG_MUXID(174U)                                                        /*!< DMAMUX TIMER44 CMT request */
#define DMA_REQUEST_TIMER44_UP            RM_CHXCFG_MUXID(175U)                                                        /*!< DMAMUX TIMER44 UP request */
#define DMA_REQUEST_TIMER50_UP            RM_CHXCFG_MUXID(176U)                                                        /*!< DMAMUX TIMER50 UP request */
#define DMA_REQUEST_TIMER51_UP            RM_CHXCFG_MUXID(177U)                                                        /*!< DMAMUX TIMER51 UP request */
#define DMA_REQUEST_SAI1_B0               RM_CHXCFG_MUXID(178U)                                                        /*!< DMAMUX SAI1 B0 request */
#define DMA_REQUEST_SAI1_B1               RM_CHXCFG_MUXID(179U)                                                        /*!< DMAMUX SAI1 B1 request */
#define DMA_REQUEST_SAI2_B0               RM_CHXCFG_MUXID(180U)                                                        /*!< DMAMUX SAI2 B0 request */
#define DMA_REQUEST_SAI2_B1               RM_CHXCFG_MUXID(181U)                                                        /*!< DMAMUX SAI2 B1 request */
#define DMA_REQUEST_SPI5_RX               RM_CHXCFG_MUXID(182U)                                                        /*!< DMAMUX SPI5 RX request */
#define DMA_REQUEST_SPI5_TX               RM_CHXCFG_MUXID(183U)                                                        /*!< DMAMUX SPI5 TX request */
#define DMA_REQUEST_I2C3_RX               RM_CHXCFG_MUXID(184U)                                                        /*!< DMAMUX I2C3 RX request */
#define DMA_REQUEST_I2C3_TX               RM_CHXCFG_MUXID(185U)                                                        /*!< DMAMUX I2C3 TX request */
#define DMA_REQUEST_CAN0                  RM_CHXCFG_MUXID(186U)                                                        /*!< DMAMUX CAN0 request */
#define DMA_REQUEST_CAN1                  RM_CHXCFG_MUXID(187U)                                                        /*!< DMAMUX CAN1 request */
#define DMA_REQUEST_CAN2                  RM_CHXCFG_MUXID(188U)                                                        /*!< DMAMUX CAN2 request */
#define DMA_REQUEST_TIMER40_CH1           RM_CHXCFG_MUXID(189U)                                                        /*!< DMAMUX TIMER40 CH1 request */
#define DMA_REQUEST_TIMER40_TRG           RM_CHXCFG_MUXID(190U)                                                        /*!< DMAMUX TIMER40 TRG request */
#define DMA_REQUEST_TIMER41_CH1           RM_CHXCFG_MUXID(191U)                                                        /*!< DMAMUX TIMER41 CH1 request */
#define DMA_REQUEST_TIMER41_TRG           RM_CHXCFG_MUXID(192U)                                                        /*!< DMAMUX TIMER41 TRG request */
#define DMA_REQUEST_TIMER42_CH1           RM_CHXCFG_MUXID(193U)                                                        /*!< DMAMUX TIMER42 CH1 request */
#define DMA_REQUEST_TIMER42_TRG           RM_CHXCFG_MUXID(194U)                                                        /*!< DMAMUX TIMER42 TRG request */
#define DMA_REQUEST_TIMER43_CH1           RM_CHXCFG_MUXID(195U)                                                        /*!< DMAMUX TIMER43 CH1 request */
#define DMA_REQUEST_TIMER43_TRG           RM_CHXCFG_MUXID(196U)                                                        /*!< DMAMUX TIMER43 TRG request */
#define DMA_REQUEST_TIMER44_CH1           RM_CHXCFG_MUXID(197U)                                                        /*!< DMAMUX TIMER44 CH1 request */
#define DMA_REQUEST_TIMER44_TRG           RM_CHXCFG_MUXID(198U)                                                        /*!< DMAMUX TIMER44 TRG request */
#define DMA_REQUEST_RDCM                  RM_CHXCFG_MUXID(201U)                                                        /*!< DMAMUX RDCM request */
#define DMA_REQUEST_ADC0_INSERTED         RM_CHXCFG_MUXID(202U)                                                        /*!< DMAMUX ADC0 INSERTED request */
#define DMA_REQUEST_ADC1_INSERTED         RM_CHXCFG_MUXID(203U)                                                        /*!< DMAMUX ADC1 INSERTED request */
#define DMA_REQUEST_ADC2_INSERTED         RM_CHXCFG_MUXID(204U)                                                        /*!< DMAMUX ADC2 INSERTED request */
#define DMA_REQUEST_TFMT                  RM_CHXCFG_MUXID(205U)                                                        /*!< DMAMUX TFMT request */
#define DMA_REQUEST_AFMT                  RM_CHXCFG_MUXID(206U)                                                        /*!< DMAMUX AFMT request */
#define DMA_REQUEST_ENDAT                 RM_CHXCFG_MUXID(207U)                                                        /*!< DMAMUX ENDAT request */
#define DMA_REQUEST_BISS                  RM_CHXCFG_MUXID(208U)                                                        /*!< DMAMUX BISS request */
#define DMA_REQUEST_SAI3_B0               RM_CHXCFG_MUXID(209U)                                                        /*!< DMAMUX SAI3 B0 request */
#define DMA_REQUEST_SAI3_B1               RM_CHXCFG_MUXID(210U)                                                        /*!< DMAMUX SAI3 B1 request */

/* DMAMUX request generator trigger input identification */                                                            
#define RG_CHXCFG_TID(regval)             (BITS(0,5) & ((uint32_t)(regval) << 0U))                                     /*!< trigger input identification */
#define DMAMUX_TRIGGER_EVT0_OUT           RG_CHXCFG_TID(0U)                                                            /*!< trigger input is Evt0_out */
#define DMAMUX_TRIGGER_EVT1_OUT           RG_CHXCFG_TID(1U)                                                            /*!< trigger input is Evt1_out */
#define DMAMUX_TRIGGER_EVT2_OUT           RG_CHXCFG_TID(2U)                                                            /*!< trigger input is Evt2_out */
#define DMAMUX_TRIGGER_EVT3_OUT           RG_CHXCFG_TID(3U)                                                            /*!< trigger input is Evt3_out */
#define DMAMUX_TRIGGER_EVT4_OUT           RG_CHXCFG_TID(4U)                                                            /*!< trigger input is Evt4_out */
#define DMAMUX_TRIGGER_EVT5_OUT           RG_CHXCFG_TID(5U)                                                            /*!< trigger input is Evt5_out */
#define DMAMUX_TRIGGER_EVT6_OUT           RG_CHXCFG_TID(6U)                                                            /*!< trigger input is Evt6_out */
#define DMAMUX_TRIGGER_EXTI0              RG_CHXCFG_TID(7U)                                                            /*!< trigger input is EXTI0 */
#define DMAMUX_TRIGGER_EXTI1              RG_CHXCFG_TID(8U)                                                            /*!< trigger input is EXTI1 */
#define DMAMUX_TRIGGER_EXTI2              RG_CHXCFG_TID(9U)                                                            /*!< trigger input is EXTI2 */
#define DMAMUX_TRIGGER_EXTI3              RG_CHXCFG_TID(10U)                                                           /*!< trigger input is EXTI3 */
#define DMAMUX_TRIGGER_EXTI4              RG_CHXCFG_TID(11U)                                                           /*!< trigger input is EXTI4 */
#define DMAMUX_TRIGGER_EXTI5              RG_CHXCFG_TID(12U)                                                           /*!< trigger input is EXTI5 */
#define DMAMUX_TRIGGER_EXTI6              RG_CHXCFG_TID(13U)                                                           /*!< trigger input is EXTI6 */
#define DMAMUX_TRIGGER_EXTI7              RG_CHXCFG_TID(14U)                                                           /*!< trigger input is EXTI7 */
#define DMAMUX_TRIGGER_EXTI8              RG_CHXCFG_TID(15U)                                                           /*!< trigger input is EXTI8 */
#define DMAMUX_TRIGGER_EXTI9              RG_CHXCFG_TID(16U)                                                           /*!< trigger input is EXTI9 */
#define DMAMUX_TRIGGER_EXTI10             RG_CHXCFG_TID(17U)                                                           /*!< trigger input is EXTI10 */
#define DMAMUX_TRIGGER_EXTI11             RG_CHXCFG_TID(18U)                                                           /*!< trigger input is EXTI11 */
#define DMAMUX_TRIGGER_EXTI12             RG_CHXCFG_TID(19U)                                                           /*!< trigger input is EXTI12 */
#define DMAMUX_TRIGGER_EXTI13             RG_CHXCFG_TID(20U)                                                           /*!< trigger input is EXTI13 */
#define DMAMUX_TRIGGER_EXTI14             RG_CHXCFG_TID(21U)                                                           /*!< trigger input is EXTI14 */
#define DMAMUX_TRIGGER_EXTI15             RG_CHXCFG_TID(22U)                                                           /*!< trigger input is EXTI15 */
#define DMAMUX_TRIGGER_RTC_WAKEUP         RG_CHXCFG_TID(23U)                                                           /*!< trigger input is wakeup*/
#define DMAMUX_TRIGGER_CMP0_OUTPUT        RG_CHXCFG_TID(24U)                                                           /*!< trigger input is CMP0 output */
#define DMAMUX_TRIGGER_CMP1_OUTPUT        RG_CHXCFG_TID(25U)                                                           /*!< trigger input is CMP1 output */
#define DMAMUX_TRIGGER_I2C0_WAKEUP        RG_CHXCFG_TID(26U)                                                           /*!< trigger input is I2C0 wakeup */
#define DMAMUX_TRIGGER_I2C1_WAKEUP        RG_CHXCFG_TID(27U)                                                           /*!< trigger input is I2C1 wakeup */
#define DMAMUX_TRIGGER_I2C2_WAKEUP        RG_CHXCFG_TID(28U)                                                           /*!< trigger input is I2C2 wakeup */
#define DMAMUX_TRIGGER_I2C3_WAKEUP        RG_CHXCFG_TID(29U)                                                           /*!< trigger input is I2C3 wakeup */
#define DMAMUX_TRIGGER_I2C0_INT_EVENT     RG_CHXCFG_TID(30U)                                                           /*!< trigger input is I2C0 interrupt event */
#define DMAMUX_TRIGGER_I2C1_INT_EVENT     RG_CHXCFG_TID(31U)                                                           /*!< trigger input is I2C1 interrupt event */
#define DMAMUX_TRIGGER_I2C2_INT_EVENT     RG_CHXCFG_TID(32U)                                                           /*!< trigger input is I2C2 interrupt event */
#define DMAMUX_TRIGGER_I2C3_INT_EVENT     RG_CHXCFG_TID(33U)                                                           /*!< trigger input is I2C3 interrupt event */
#define DMAMUX_TRIGGER_ADC2_INT           RG_CHXCFG_TID(34U)                                                           /*!< trigger input is ADC2 interrupt */
#define DMAMUX_TRIGGER_ADC2_AWD0_OUT      RG_CHXCFG_TID(35U)                                                           /*!< trigger input is ADC2 AWD0 OUT */
#define DMAMUX_TRIGGER_EXTI0_EVENT        RG_CHXCFG_TID(36U)                                                           /*!< trigger input is EXTI0 event*/
#define DMAMUX_TRIGGER_EXTI1_EVENT        RG_CHXCFG_TID(37U)                                                           /*!< trigger input is EXTI1 event*/
#define DMAMUX_TRIGGER_EXTI2_EVENT        RG_CHXCFG_TID(38U)                                                           /*!< trigger input is EXTI2 event*/
#define DMAMUX_TRIGGER_EXTI3_EVENT        RG_CHXCFG_TID(39U)                                                           /*!< trigger input is EXTI3 event*/
#define DMAMUX_TRIGGER_EXTI4_EVENT        RG_CHXCFG_TID(40U)                                                           /*!< trigger input is EXTI4 event*/
#define DMAMUX_TRIGGER_EXTI5_EVENT        RG_CHXCFG_TID(41U)                                                           /*!< trigger input is EXTI5 event*/
#define DMAMUX_TRIGGER_EXTI6_EVENT        RG_CHXCFG_TID(42U)                                                           /*!< trigger input is EXTI6 event*/
#define DMAMUX_TRIGGER_EXTI7_EVENT        RG_CHXCFG_TID(43U)                                                           /*!< trigger input is EXTI7 event*/
#define DMAMUX_TRIGGER_EXTI8_EVENT        RG_CHXCFG_TID(44U)                                                           /*!< trigger input is EXTI8 event*/
#define DMAMUX_TRIGGER_EXTI9_EVENT        RG_CHXCFG_TID(45U)                                                           /*!< trigger input is EXTI9 event*/
#define DMAMUX_TRIGGER_EXTI10_EVENT       RG_CHXCFG_TID(46U)                                                           /*!< trigger input is EXTI10 event*/
#define DMAMUX_TRIGGER_EXTI11_EVENT       RG_CHXCFG_TID(47U)                                                           /*!< trigger input is EXTI11 event*/
#define DMAMUX_TRIGGER_EXTI12_EVENT       RG_CHXCFG_TID(48U)                                                           /*!< trigger input is EXTI12 event*/
#define DMAMUX_TRIGGER_EXTI13_EVENT       RG_CHXCFG_TID(49U)                                                           /*!< trigger input is EXTI13 event*/
#define DMAMUX_TRIGGER_EXTI14_EVENT       RG_CHXCFG_TID(50U)                                                           /*!< trigger input is EXTI14 event*/
#define DMAMUX_TRIGGER_EXTI15_EVENT       RG_CHXCFG_TID(51U)                                                           /*!< trigger input is EXTI15 event*/
#define DMAMUX_TRIGGER_EXTI19_EVENT       RG_CHXCFG_TID(52U)                                                           /*!< trigger input is EXTI19 event*/
#define DMAMUX_TRIGGER_EXTI20_EVENT       RG_CHXCFG_TID(53U)                                                           /*!< trigger input is EXTI20 event*/
#define DMAMUX_TRIGGER_EXTI21_EVENT       RG_CHXCFG_TID(54U)                                                           /*!< trigger input is EXTI21 event*/
#define DMAMUX_TRIGGER_EXTI33_EVENT       RG_CHXCFG_TID(55U)                                                           /*!< trigger input is EXTI33 event*/
#define DMAMUX_TRIGGER_EXTI34_EVENT       RG_CHXCFG_TID(56U)                                                           /*!< trigger input is EXTI34 event*/
#define DMAMUX_TRIGGER_EXTI35_EVENT       RG_CHXCFG_TID(57U)                                                           /*!< trigger input is EXTI35 event*/
#define DMAMUX_TRIGGER_EXTI36_EVENT       RG_CHXCFG_TID(58U)                                                           /*!< trigger input is EXTI36 event*/

